diverta/onecard-fido/nRF52840_app/examples/diverta/plat_lib/sha1.c
/* 
 * File:   sha1.c
 * Author: makmorit
 *
 * Created on 2022/11/24, 18:37
 */
#include <stdint.h>
#include <stddef.h>
#include <string.h>

#include "sdk_common.h"

// for logging informations
#define NRF_LOG_MODULE_NAME sha1
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#include "sha1_define.h"

struct sha1_context {
    uint32_t state[5];
    uint32_t count[2];
    uint8_t  buffer[64];
};
typedef struct sha1_context SHA1_CTX;

static void wipe_sha1_context(SHA1_CTX *context)
{
    memset(context->state,  0, 5);
    memset(context->count,  0, 2);
    memset(context->buffer, 0, 64);
}

static void sha1_init(SHA1_CTX *context)
{
    // SHA1 initialization constants
    context->state[0] = 0x67452301;
    context->state[1] = 0xEFCDAB89;
    context->state[2] = 0x98BADCFE;
    context->state[3] = 0x10325476;
    context->state[4] = 0xC3D2E1F0;
    context->count[0] = context->count[1] = 0;
}

static void sha1_transform(uint32_t state[5], uint8_t buffer[64])
{
    //
    // Hash a single 512-bit block. 
    // This is the core of the algorithm.
    //
    uint32_t a, b, c, d, e;

    typedef union {
        uint8_t  c[64];
        uint32_t l[16];
    } CHAR64LONG16;
    CHAR64LONG16 *block;

#ifdef SHA1HANDSOFF
    CHAR64LONG16 workspace;
    block = &workspace;
    memcpy(block, buffer, 64);
#else
    block = (CHAR64LONG16 *)buffer;
#endif

    // Copy context->state[] to working vars
    a = state[0];
    b = state[1];
    c = state[2];
    d = state[3];
    e = state[4];

    // 4 rounds of 20 operations each. Loop unrolled.
    R0(a,b,c,d,e, 0);
    R0(e,a,b,c,d, 1);
    R0(d,e,a,b,c, 2);
    R0(c,d,e,a,b, 3);
    R0(b,c,d,e,a, 4);
    R0(a,b,c,d,e, 5);
    R0(e,a,b,c,d, 6);
    R0(d,e,a,b,c, 7);
    R0(c,d,e,a,b, 8);
    R0(b,c,d,e,a, 9);
    R0(a,b,c,d,e,10);
    R0(e,a,b,c,d,11);
    R0(d,e,a,b,c,12);
    R0(c,d,e,a,b,13);
    R0(b,c,d,e,a,14);
    R0(a,b,c,d,e,15);
    R1(e,a,b,c,d,16);
    R1(d,e,a,b,c,17);
    R1(c,d,e,a,b,18);
    R1(b,c,d,e,a,19);
    R2(a,b,c,d,e,20);
    R2(e,a,b,c,d,21);
    R2(d,e,a,b,c,22);
    R2(c,d,e,a,b,23);
    R2(b,c,d,e,a,24);
    R2(a,b,c,d,e,25);
    R2(e,a,b,c,d,26);
    R2(d,e,a,b,c,27);
    R2(c,d,e,a,b,28);
    R2(b,c,d,e,a,29);
    R2(a,b,c,d,e,30);
    R2(e,a,b,c,d,31);
    R2(d,e,a,b,c,32);
    R2(c,d,e,a,b,33);
    R2(b,c,d,e,a,34);
    R2(a,b,c,d,e,35);
    R2(e,a,b,c,d,36);
    R2(d,e,a,b,c,37);
    R2(c,d,e,a,b,38);
    R2(b,c,d,e,a,39);
    R3(a,b,c,d,e,40);
    R3(e,a,b,c,d,41);
    R3(d,e,a,b,c,42);
    R3(c,d,e,a,b,43);
    R3(b,c,d,e,a,44);
    R3(a,b,c,d,e,45);
    R3(e,a,b,c,d,46);
    R3(d,e,a,b,c,47);
    R3(c,d,e,a,b,48);
    R3(b,c,d,e,a,49);
    R3(a,b,c,d,e,50);
    R3(e,a,b,c,d,51);
    R3(d,e,a,b,c,52);
    R3(c,d,e,a,b,53);
    R3(b,c,d,e,a,54);
    R3(a,b,c,d,e,55);
    R3(e,a,b,c,d,56);
    R3(d,e,a,b,c,57);
    R3(c,d,e,a,b,58);
    R3(b,c,d,e,a,59);
    R4(a,b,c,d,e,60);
    R4(e,a,b,c,d,61);
    R4(d,e,a,b,c,62);
    R4(c,d,e,a,b,63);
    R4(b,c,d,e,a,64);
    R4(a,b,c,d,e,65);
    R4(e,a,b,c,d,66);
    R4(d,e,a,b,c,67);
    R4(c,d,e,a,b,68);
    R4(b,c,d,e,a,69);
    R4(a,b,c,d,e,70);
    R4(e,a,b,c,d,71);
    R4(d,e,a,b,c,72);
    R4(c,d,e,a,b,73);
    R4(b,c,d,e,a,74);
    R4(a,b,c,d,e,75);
    R4(e,a,b,c,d,76);
    R4(d,e,a,b,c,77);
    R4(c,d,e,a,b,78);
    R4(b,c,d,e,a,79);

    // Add the working vars back into context.state[]
    state[0] += a;
    state[1] += b;
    state[2] += c;
    state[3] += d;
    state[4] += e;

    // Wipe variables
    a = b = c = d = e = 0;

#ifdef SHA1HANDSOFF
    memset(block, 0, 64);
#endif
}

static void sha1_update(SHA1_CTX *context, void *_data, uint32_t len)
{
    uint32_t i, j;
    uint8_t *data = _data;

    j = (context->count[0] >> 3) & 63;
    if ((context->count[0] += len << 3) < (len << 3)) {
        context->count[1]++;
    }
    context->count[1] += (len >> 29);

    if ((j + len) > 63) {
        i = 64 - j;
        memcpy(&context->buffer[j], data, i);
        sha1_transform(context->state, context->buffer);
        while (i + 63 < len) {
            sha1_transform(context->state, &data[i]);
            i += 64;
        }
        j = 0;

    } else {
        i = 0;
    }

    memcpy(&context->buffer[j], &data[i], len - i);
}

static void sha1_final(uint8_t *digest, SHA1_CTX *context)
{
    //
    // Add padding and return the message digest.
    //
    uint32_t i;
    uint8_t finalcount[8];
    for (i = 0; i < 8; i++) {
        // Endian independent
        finalcount[i] = (uint8_t)((context->count[(i >= 4 ? 0 : 1)] >> ((3 - (i & 3)) * 8)) & 255);
    }

    sha1_update(context, (uint8_t *) "\200", 1);
    while ((context->count[0] & 504) != 448) {
        sha1_update(context, (uint8_t *) "\0", 1);
    }
    // Should cause a SHA1Transform()
    sha1_update(context, finalcount, 8);

    for (i = 0; i < SHA1_MAC_LEN; i++) {
        digest[i] = (uint8_t)((context->state[i >> 2] >> ((3 - (i & 3)) * 8)) & 255);
    }

    // Wipe variables
    i = 0;
    wipe_sha1_context(context);
    memset(finalcount, 0, 8);
}

void sha1_hash_calculate(size_t num_elem, uint8_t *addr[], size_t *len, uint8_t *mac)
{
    SHA1_CTX ctx;
    sha1_init(&ctx);

    // 引数のバイト配列数分、updateを実行
    for (size_t i = 0; i < num_elem; i++) {
        sha1_update(&ctx, addr[i], len[i]);
    }

    sha1_final(mac, &ctx);
}
